a = int(input("a="))
b = int(input("b="))
c = int(input("c="))
d = int(input("d="))
import math
if a == 0:
    print("Это не кубическое уравнение")
else:
    q = ((2*b**3)-(9*a*b*c)+(27*(a**2)*d))/(27*a**3)
    print(q)
    p = (3*a*c-b**2)/3*a**2
    Q = (p/3)**3+(q/2)**2
    if Q > 0:
        g = (q/2)**2+(p/3)**3
        x1 = ((-q/2-Q**0.5)**(1/3))+((-q/2-Q**0.5)**(1/3))
        #x2 = -1/2*((-q/2+Q**0.5)**(1/3)+(-q/2-Q**0.5)**(1/3))+i*3**0.5/2*((-q/2+Q**0.5)**(1/3)-(-q/2-Q**0.5)**(1/3))
        #x3 = -1/2*((-q/2+Q**0.5)**(1/3)+(-q/2-Q**0.5)**(1/3))-i*3**0.5/2*((-q/2+Q**0.5)**(1/3)-(-q/2-Q**0.5)**(1/3))
        print(x1, "Два комплексно сопряженных корня")
    elif Q < 0:
        x1 = 2*(-p/3)**0.5*math.cos(3.14/6)-2
        x2 = 2*(-p/3)**0.5*math.cos(5*3.14/6)-2
        x3 = 2*(-p/3)**0.5*math.cos(3*3.14/6)-2
        print(x1, x2, x3)

    else:        
        x1 = 2*(-q/2)**(1/3)-4
        x2 = -(-q/2)**(1/3)-4       
        print(x1, x2)

