import datetime
x = input("Напишите время в формате ЧЧ:ММ или введите NOW для текущего времени: ")
if x == 'NOW':
    t = datetime.datetime.today().strftime("%H:%M")
    h = int(datetime.datetime.today().strftime("%I"))
    m = int(datetime.datetime.today().strftime("%M"))
else:
    a = x.split(':')
    h1 =int(a[0])
    m = int(a[1])
    t = x
    if h1 > 12:
        h = h1-12
    else:
        h = h1
print(t)
if m == 0:
    dh = { 1: "Час", 2: "Два часа", 3: "Три часа", 4:"Четыре часа", 5: "Пять часов", 6: "Шесть часов", 7: "Семь часов", 8: "Восемь часов", 9: "Девять часов", 10: "десять часов", 11: "Одинадцать часов", 12: "Двенадцать часов", 0: "Поночь"}
    print(dh[h])
elif m < 30:
    dh = {0: "первого", 1: "второго", 2: "третьего", 3: "четвертого", 4: "пятого", 5: "шестого", 6: "седьмого", 7: "восьмого", 8: "девятого", 9: "десятого", 10: "одинадцатаго", 11: "двенадцатого", 12: "первого"}
    dm = {1: "Одна минута", 2: "Две минуты", 3: "Три минуты", 4: "Четыре минуты", 5: "Пять минут", 6: "Шесть минут", 7: "Семь минут", 8: "Восемь минут", 9: "Девять минут", 10: "Десять минут", 11: "Одинадцать минут", 12: "Двенадцать минут", 13: "Тринадцать минут", 14: "Четырнадцать минут", 15: "Пятнадцать минут", 16: "Шестнадцать минут", 17: "Семьнадцать минут", 18: "Восемьнадцать минут", 19: "Девятнадцать минут", 20: "Двадцать минут", 21: "Двадцать одна минута", 22: "Двадцать две минуты", 23: "Двадцать три минуты", 24: "Двадцать четыре минуты", 25: "Двадцать пять минут", 26: "Двадцать шесть минут", 27: "Двадцать семь минут", 28: "Двадцать восемь минут", 29: "Двадцать девять минут"}
    print(dm[m], dh[h])
elif m == 30:
    dh = {0: "первого", 1: "второго", 2: "третьего", 3: "четвертого", 4: "пятого", 5: "шестого", 6: "седьмого", 7: "восьмого", 8: "девятого", 9: "десятого", 10: "одинадцатаго", 11: "двенадцатого", 12: "первого"}
    print("Половина", dh[h])
elif m > 44:
    dh = {0: "час", 1: "два", 2: "три", 3: "четыре", 4: "пять", 5: "шесть", 6: "семь", 7: "восемь", 8: "девять", 9: "десять", 10: "одинадцать", 11: "двенадцать", 12: "час"}
    dm = {45: "Без пятнадцати минут", 46: "Без четырнадцати минут", 47: "Без тринадцати минут", 48: "Без двенадцати минут", 49: "Без одиннадцати минут", 50: "Без десяти минут", 51: "Без девяти минут", 52: "Без восьми минут", 53: "Без семи минут", 54: "Без шести минут", 55: "Без пяти минут", 56: "Без четырех минут", 57: "Без трех  минут", 58: "Без двух  минут", 59: "Без одной минуты"}
    print(dm[m], dh[h])
else:
    dh = {0: "первого", 1: "второго", 2: "третьего", 3: "четвертого", 4: "пятого", 5: "шестого", 6: "седьмого", 7: "восьмого", 8: "девятого", 9: "десятого", 10: "одинадцатаго", 11: "двенадцатого", 12: "первого"}
    dm = {31: "Тридцать одна минута", 32: "Тридцать две минуты", 33: "Тридцать три минуты", 34: "Тридцать четыре минуты", 35: "Тридцать пять минут", 36: "Тридцать шесть минут", 37: "Тридцать семь минут", 38: "Тридцать восемь минут", 39: "Тридцать девять минут", 40: "Сорок минут", 41: "Сорок одна минута", 42: "Сорок две минуты", 43: "Сорок три минуты", 44: "Сорок четыре минуты"}
    print(dm[m], dh[h])
        