# Реализовать:
# 1.текстовый вывод текущего времени
# 2.текстовый вывод времени, введённого с консоли (hh:mm).
# Для получения текущего времени использовать модуль datetime.
# min < 30: столько-то минут следующего часа
# min == 30: половина такого-то
# min > 30 and min < 45 столько-то минут следующего часа
# min >= 45 без min такого-то
# 21:16
# шестнадцать минут десятого
# test


import datetime
import time

time1 = datetime.datetime.today().strftime("%H.%M")#текущее время
h1 = int(time1.split(".")[0])
m1 = int(time1.split(".")[1])

time2 = input ("введите время в формате(hh:mm)")#введеное время
#time2 = "15:27"
h2 = int(time2.split(":")[0])
m2 = int(time2.split(":")[1])

def Time_Machine(h,m):
 if h > 23 or m > 59:
    print('Неправильный ввод')
    exit()
 else:

  if m in range(20,30): #первое слово,десятки минут
    print("двадцать", end=' ')
  elif m == 30:
    print("половина", end=' ')
  elif m in range(31,40):
    print("тридцать", end=' ')
  elif m in range(40,45):
    print("сорок", end=' ')
  elif m in range(45,60):
    print("без", end=' ')


 d1 = {1:'одна',2:'две',3:'три',4:'четыре',5:'пять',6:'шесть',7:'семь',8:'восемь',9:'девять',10:'десять',11:'одинадцать',12:'двенадцать'}
 d2 = {10:'десять',11:'одинадцать',12:'двенадцать',13:'тренадцать',14:'четырнадцать',15:'пятнадцать',16:'шестнадцать',17:'семнадцать',18:'восемнадцать',19:'девятнадцать'}
 d3 = {45:'пятнадцати',46:'четырнадцати',47:'тренадцати',48:'двенадцати',49:'одинадцати',50:'десяти',51:'девяти',52:'восьми',53:'семи',54:'шести',55:'пяти',56:'четырех',57:'трех',58:'двух',59:'одной'}
 d4 = {1:'первого',2:'второго',3:'третьего',4:'четвертого',5:'пятого',6:'шестого',7:'седьмого',8:'восьмого',9:'девятого',10:'десятого',11:'одинадцатаго',12:'двенадцатаго'}
 d5 = {1:'один',2:'два'}

 if m in range(1,10): #вторая цифра минут
  print(d1[m], end=' ')
 elif m in range(10,20):
  print(d2[m], end=' ')
 elif m in range(21,30):
  print(d1[m-20], end=' ')
 elif m in range(31,40):
  print(d1[m-30], end=' ')
 elif m in range(41,45):
  print(d1[m-40], end=' ')
 elif m in range(45,60):
  print(d3[m], end=' ')
 elif m == 0:
  print(" ", end=' ')

 if m in range(1,42,10): # приставка слова "минуты"
  print('минута', end=' ')
 elif m in range(2,45):
    if m % 10 in range(2,5):
     print('минуты', end=' ')
    elif  m == 30:
     print(' ', end=' ')
    else:
     print('минут', end=' ')
 elif m == 0:
  print(' ', end=' ')
 else:
  print('минут', end=' ')

 if m == 0: #  часы если 0 минут
    if h in range(1,3):
     print(d5[h], end=' ')
    elif h in range(3,13):
     print(d1[h], end=' ')
    elif h in range(13,15):
     print(d5[h-12], end=' ')
    elif h in range(15,24):
     print(d1[h-12], end=' ')
    elif h == 0:
     print(d1[12], end=' ')
 else:
  if h in range(1,12): # часы если не 0 минут
   print(d4[h+1])
  elif h in range(12,24):
   print(d4[h-11])
  elif h == 0:
   print(d4[1])

 if m == 0: # приставка слова "часов" если 0 минут
    if h == 1 or h== 13:
     print('час')
    elif h in range(2,5) or h in range(14,17) :
     print('часа')
    else:
     print('часов')

print("Текщее время:")  
Time_Machine(h1,m1)
print("Введенное время:")
Time_Machine(h2,m2)